{
  "scienceArticles": [
    {
      "id": "science-1",
      "title": "Cannabis Research Highlights – September 2025",
      "summary": "Research published in September 2025 highlights both therapeutic benefits and risks of cannabis use: new pharmacotherapies for cannabis use disorder are being tested; high-THC products are consistently associated with adverse mental health outcomes; preclinical studies confirm anti-inflammatory and antinociceptive effects; and medical cannabis shows improvements in cancer patients’ quality of life, though study quality remains variable.",
      "content": "# Cannabis Research Highlights – September 2025\n\nRecent cannabis research highlights both therapeutic benefits and risks:\n- Novel pharmacotherapies for cannabis use disorder are under review.\n- High-THC products are linked to adverse mental health outcomes.\n- Preclinical studies confirm anti-inflammatory and antinociceptive effects.\n- Medical cannabis may improve quality of life in cancer patients, albeit with methodological limitations.\n\n## Emerging Pharmacological Strategies for Cannabis Use Disorder\n**Authors:** Lake et al.  \n**Year:** 2025  \n**Journal:** Expert Opinion on Emerging Drugs  \n**DOI:** 10.1080/14656566.2025.2558999  \n**Summary:** Narrative review of pharmacological agents (FAAH inhibitors, orexin antagonists, gabapentin, N-acetylcysteine) for cannabis use disorder. Early-phase data show potential but no drug has robust efficacy for long-term recovery.  \n**Limitations:** Small, heterogeneous studies; lack of Phase III trials.\n\n## High-Concentration THC Cannabis Products and Mental Health Outcomes\n**Authors:** Gruber et al.  \n**Year:** 2025  \n**Journal:** Annals of Internal Medicine  \n**DOI:** 10.1093/pm/pnaf110  \n**Summary:** Systematic review of 99 studies (n=221,097). High-THC products (>10% THC) were linked to higher risks of psychosis, schizophrenia, and cannabis use disorder. Therapeutic effects on anxiety and depression were mixed.  \n**Limitations:** Moderate–high bias across studies; inconsistent product definitions.\n\n## Antinociceptive and Anti-inflammatory Effects of Cannabis sativa L.\n**Authors:** Martínez-González et al.  \n**Year:** 2025  \n**Journal:** Frontiers in Pharmacology  \n**DOI:** 10.3389/fphar.2025.1677987  \n**Summary:** Preclinical rodent study of ethanolic extract of Cannabis sativa reduced writhing, inflammation, and uterine contractions. Active compounds included THC, CBD, CBG, and flavonoids.  \n**Limitations:** Animal-only study; translation to humans uncertain.\n\n## Medical Cannabis and Cancer Patients’ Quality of Life\n**Authors:** Silva et al.  \n**Year:** 2025  \n**Journal:** Cannabis and Cannabinoid Research  \n**DOI:** 10.1177/27683605251377417  \n**Summary:** Review of 16 studies (including 4 RCTs). Medical cannabis improved sleep, appetite, pain, and nausea/vomiting in cancer patients, with mostly mild side effects. Some evidence of improved survival.  \n**Limitations:** Small, heterogeneous studies; some potential conflicts of interest.\n\n## Conclusion\nRecent evidence shows cannabis has therapeutic promise but also notable risks, particularly with high-THC products. Stronger, large-scale studies are needed to inform balanced regulation in Albania and beyond.",
      "category": "Science",
      "date": "2025-09-16",
      "author": "Legalize Albania - Science Team",
      "readTime": "11 min read",
      "featured": true,
      "slug": "cannabis-research-highlights-september-2025",
      "tags": ["research", "therapeutics", "mental health", "cannabis use disorder", "medical cannabis", "THC effects"],
      "published": true,
      "tldr": "September 2025 research highlights therapeutic benefits and risks: novel CUD treatments under review, high-THC linked to mental health harms, preclinical anti-inflammatory effects confirmed, and medical cannabis improves cancer patients’ quality of life with limitations.",
      "keywords": ["cannabis research", "therapeutics", "mental health", "CUD treatment", "medical cannabis", "THC effects"]
    }
  ]
}





